hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/VaKueMrnAbg_StornoAenderung_07/STR.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns0:cancelCarrierChange xmlns:ns0="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <ns0:STR-AEN-REC>
                <ns0:absender>
                    <ns0:carrierCode>${carrierCodeAuf}</ns0:carrierCode>
                </ns0:absender>
                <ns0:empfaenger>
                    <ns0:carrierCode>${carrierCodeAbg}</ns0:carrierCode>
                </ns0:empfaenger>
                <ns0:version>2</ns0:version>
                <ns0:endkundenvertragspartner>
                    <ns0:EKPauf>
                        <ns0:carrierCode>${carrierCodeAuf}</ns0:carrierCode>
                    </ns0:EKPauf>
                    <ns0:EKPabg>
                        <ns0:carrierCode>${carrierCodeAbg}</ns0:carrierCode>
                    </ns0:EKPabg>
                </ns0:endkundenvertragspartner>
                <ns0:stornoId>${stornoId}</ns0:stornoId>
                <ns0:vorabstimmungsIdRef>${preAgreementId}</ns0:vorabstimmungsIdRef>
                <ns0:name>
                    <ns0:person>
                        <ns0:anrede>1</ns0:anrede>
                        <ns0:vorname>${endkunde.vorname}</ns0:vorname>
                        <ns0:nachname>${endkunde.nachname}</ns0:nachname>
                    </ns0:person>
                </ns0:name>
                <ns0:standort>
                    <ns0:strasse>
                        <ns0:strassenname>${standort.strasse}</ns0:strassenname>
                        <ns0:hausnummer>${standort.hnr}</ns0:hausnummer>
                    </ns0:strasse>
                    <ns0:postleitzahl>${standort.plz}</ns0:postleitzahl>
                    <ns0:ort>${standort.ort}</ns0:ort>
                </ns0:standort>
            </ns0:STR-AEN-REC>
        </ns0:cancelCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>